app/Http/Controllers/Frontend/DashboardController.php

select * from `transactions` where `user_id` = 3 order by `created_at` desc limit 5
select count(*) as aggregate from `transactions` where `user_id` = 3 limit 5
select * from `tickets` where `tickets`.`user_id` = 3 and `tickets`.`user_id` is not null
---
    public function dashboard(Request $request)
    {
//        dd(getLocation(),'dashboar');
        $user = auth()->user();

        $clientIp = request()->ip();
        if(!in_array($clientIp,['127.0.0.1' , '::1'])) {
            $this->syncForexAccounts(auth()->id());
        }

        $transactions = Transaction::where('user_id', $user->id);

        $recentTransactions = $transactions->latest()->take(5)->get();

        $referral = $user->getReferrals()->first();

        $dataCount = [
            'total_transaction' => $transactions->count(),
            'total_deposit' => $user->totalDeposit(),
            'total_investment' => $user->totalInvestment(),
            'total_profit' => $user->totalProfit(),
            'profit_last_7_days' => $user->totalProfit(7),
            'total_withdraw' => $user->totalWithdraw(),
            'total_transfer' => $user->totalTransfer(),
            'total_referral_profit' => $user->totalReferralProfit(),
            'total_referral' => $referral->relationships()->count(),

            'deposit_bonus' => $user->totalDepositBonus(),
            'investment_bonus' => $user->totalInvestBonus(),
            'rank_achieved' => $user->rankAchieved(),
            'total_ticket' => $user->ticket->count(),
            'total_forex_balance' => $user->totalForexBalance(),
            'total_forex_equity' => $user->totalForexEquity(),
        ];