app/Http/Controllers/Frontend/DepositController.php

    public function depositMethods()
    {
        $user = auth()->user();
        $userBranchId = getUserBranchId($user->id, $user);

        $gatewaysQuery = DepositMethod::where('status', 1)
            ->with('branches')
            ->where(function($query) use ($user) {
                $query->whereJsonContains('country', $user->country)
                    ->orWhereJsonContains('country', 'All');
            });
---
select * from `deposit_methods` where `status` = 1