app/Http/Controllers/Frontend/HomeController.php

    public function home()
    {

        $customLandingTheme = Theme::where('type', 'landing')->where('status', true)->first();
---
select * from `themes` where `type` = 'landing' and `status` = 1 limit 1