app/Http/Controllers/Frontend/ReferralController.php

    public function referral()
    {
//        dd('ss');
        if (! setting('sign_up_referral', 'permission')) {
            abort('404');
        }
        $user = auth()->user();

//        if (setting('site_referral', 'global') == 'level') {
//            $referrals = Transaction::where('user_id', $user->id)->where('target_type', '!=', null)->where('is_level', '=', 1)->get()->groupBy('level');
//        } else {
//            $referrals = Transaction::where('user_id', $user->id)->where('target_type', '!=', null)->get()->groupBy('target');
//        }
//
//        $generalReferrals = Transaction::where('user_id', $user->id)->where('target_type', null)->where('type', TxnType::Referral)->latest()->paginate(8);
//
        $getReferral = $user->getReferrals()->first();
//        $totalReferralProfit = $user->totalReferralProfit();

        $level = LevelReferral::max('the_order');
---
select max(`the_order`) as aggregate from `level_referrals`

                }
            }
        }
        $ibQuestions = IbQuestion::where('status', true)->get();
---
select * from `ib_questions` where `status` = 1

    public function advertisementMaterial()
    {
        $advertisements = AdvertisementMaterial::where('status',true)->get();
---
select * from `advertisement_materials` where `status` = 1