app/Models/ReferralLink.php

select * from `referral_links` where (`user_id` = 3 and `referral_program_id` = 1) limit 1
---
    public static function getReferral($user, $program)
    {
        return static::firstOrCreate([
            'user_id' => $user->id,
            'referral_program_id' => $program->id,
        ]);