app/Models/Transaction.php

    public function totalDepositBonus()
    {
        return $this->where('status', TxnStatus::Success)->where(function ($query) {
            $query->where('target_id', '!=', null)
                ->where('target_type', 'deposit')
                ->where('type', TxnType::Referral);
        })->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where `status` = 'success' and (`target_id` is not null and `target_type` = 'investment' and `type` = 'referral')