app/Models/User.php

    public function totalProfit($days = null)
    {
        $sum = $this->transaction()->where('status', TxnStatus::Success)->where(function ($query) {
            $query->where('type', TxnType::Referral)
                ->orWhere('type', TxnType::SignupBonus)
                ->orWhere('type', TxnType::Interest)
                ->orWhere('type', TxnType::Bonus);

        });

        if (null != $days) {
            $sum->where('created_at', '>=', Carbon::now()->subDays((int) $days));
        }
        $sum = $sum->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where `transactions`.`user_id` = 3 and `transactions`.`user_id` is not null and `status` = 'success' and (`type` = 'referral' or `type` = 'signup_bonus' or `type` = 'interest' or `type` = 'bonus') and `created_at` >= '2024-01-05 12:20:59'

    public function getReferrals()
    {
        return ReferralProgram::all()->map(function ($program) {
            return ReferralLink::getReferral($this, $program);
        });
---
select * from `referral_programs`

    public function totalDeposit()
    {
        $sum = $this->transaction()->where('status', TxnStatus::Success)->where(function ($query) {
            $query->where('type', TxnType::Deposit)
                ->orWhere('type', TxnType::ManualDeposit);
        })->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where `transactions`.`user_id` = 3 and `transactions`.`user_id` is not null and `status` = 'success' and (`type` = 'investment')

    public function totalDepositBonus()
    {
        $sum = $this->transaction()->where('status', TxnStatus::Success)->where(function ($query) {
            $query->where('target_id', '!=', null)
                ->where('target_type', 'deposit')
                ->where('type', TxnType::Referral);
        })->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where `transactions`.`user_id` = 3 and `transactions`.`user_id` is not null and `status` = 'success' and (`target_id` is not null and `target_type` = 'investment' and `type` = 'referral')

    public function totalInvestBonus()
    {
        $sum = $this->transaction()->where('status', TxnStatus::Success)->where(function ($query) {
            $query->where('target_id', '!=', null)
                ->where('target_type', 'investment')
                ->where('type', TxnType::Referral);
        })->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where `transactions`.`user_id` = 3 and `transactions`.`user_id` is not null and `status` = 'success' and (`type` = 'send_money')

    public function totalWithdraw()
    {
        $sum = $this->transaction()->where('status', TxnStatus::Success)->where(function ($query) {
            $query->where('type', TxnType::Withdraw)
                ->orWhere('type', TxnType::WithdrawAuto);
        })->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where `transactions`.`user_id` = 3 and `transactions`.`user_id` is not null and `status` = 'success' and (`type` = 'referral')