app/Http/Controllers/Backend/AdvertisementMaterialController.php

select * from `advertisement_materials`
---
    public function index()
    {
        $advertisements = AdvertisementMaterial::all();

insert into `advertisement_materials` (`language`, `type`, `status`, `img`, `updated_at`, `created_at`) values ('Afghanistan', 'Social_media', '1', 'global/images/YQ5OXTZCQ3bFa5x9gjYs.png', '2024-01-15 08:17:53', '2024-01-15 08:17:53')
---
    public function store(Request $request)
    {
//        dd($request->all());

        $validator = Validator::make($request->all(), [
            'img' => 'required',
            'language' => 'required',
            'type' => 'required',
        ]);

        if ($validator->fails()) {
            notify()->error($validator->errors()->first(), 'Error');

            return redirect()->back();
        }

        $input = $request->all();

        $finalData = [
            'language' => $input['language'],
            'type' => $input['type'],
            'status' => $input['status'],
            'img' => self::imageUploadTrait($input['img']),
        ];
//        dd($finalData);


        AdvertisementMaterial::create($finalData);

select * from `advertisement_materials` where `advertisement_materials`.`id` = '1' limit 1
---
    public function edit($id)
    {
        $advertisement = AdvertisementMaterial::find($id);

select * from `advertisement_materials` where `advertisement_materials`.`id` = '1' limit 1
update `advertisement_materials` set `language` = 'Aland Islands', `type` = 'website_banner', `advertisement_materials`.`updated_at` = '2024-01-15 08:22:06' where `id` = 1
---
    public function update(Request $request, $id)
    {

        $validator = Validator::make($request->all(), [
//            'img' => 'required',
            'language' => 'required',
            'type' => 'required',
        ]);

        if ($validator->fails()) {
            notify()->error($validator->errors()->first(), 'Error');

            return redirect()->back();
        }

        $advertisement = AdvertisementMaterial::find($id);
        $input = $request->all();
//dd($input);
        $finalData = [
            'language' => $input['language'],
            'type' => $input['type'],
            'icon' => $request->hasFile('img') ? self::imageUploadTrait($input['img']) : $advertisement->img,
        ];
//        dd($finalData);

        $advertisement->update($finalData);