app/Http/Controllers/Backend/DashboardController.php

    public function dashboard()
    {

        $loggedInUser = auth()->user(); // Get the logged-in user
        if (!$loggedInUser->hasRole('Super-Admin')) {
            return redirect()->route('admin.staff.dashboard');
        }
        // if ($loggedInUser->hasRole('Super-Admin')) {
        //     return redirect()->route('admin.user.active');
        // }
        $transaction = new Transaction();
        $user = new User();
        $admin = new Admin();

        $totalDeposit = $transaction->totalDeposit();

        $totalSend = Transaction::where('status', TxnStatus::Success)->where(function ($query) {
            $query->where('type', TxnType::SendMoney);
        })->sum('amount');

        $activeUser = $user->where('status', 1)->count();
---
select count(*) as aggregate from `users` where `status` = 1