app/Http/Controllers/Backend/DashboardController.php

select sum(`amount`) as aggregate from `transactions` where `status` = 'success' and (`type` = 'send_money')
select count(*) as aggregate from `admins`
select * from `users` order by `created_at` desc limit 5
select * from `invests` order by `created_at` desc limit 5
select * from `schemas` where `schemas`.`id` in (1, 2, 5)
select count(*) as aggregate from `gateways` where `status` = 1
select count(*) as aggregate from `transactions` where (`type` = 'manual_deposit' and `status` = 'pending')
select * from `transactions` where `status` = 'success' and (`type` = 'manual_deposit' or `type` = 'deposit') and `created_at` between '2023-12-28 21:42:08' and '2024-01-13 21:42:08'
select count(*) as aggregate from `referral_relationships`
select * from `invests` where not `status` = 'canceled'
---
    public function dashboard()
    {

        $transaction = new Transaction();
        $user = new User();
        $admin = new Admin();

        $totalDeposit = $transaction->totalDeposit();

        $totalSend = Transaction::where('status', TxnStatus::Success)->where(function ($query) {
            $query->where('type', TxnType::SendMoney);
        })->sum('amount');

        // $activeUser = $user->where('status', 1)->count();




        $totalStaff = $admin->count();

        $latestUser = $user->latest()->take(5)->get();

        $latestInvest = Invest::with('schema')->take(5)->latest()->get();

        $totalGateway = Gateway::where('status', true)->count();

        $withdrawCount = Transaction::where(function ($query) {
            $query->where('type', TxnType::Withdraw)
                ->where('status', 'pending');
        })->count();

        $kycCount = $user->where('kyc', KYCStatus::Pending)->count();

        $depositCount = Transaction::where(function ($query) {
            $query->where('type', TxnType::ManualDeposit)
                ->where('status', 'pending');
        })->count();

        $totalReferral = ReferralRelationship::count();

        // ============================= Start dashboard statistics =============================================

        $schemeStatistics = Invest::whereNot('status', 'canceled')->get()->groupBy('schema.name')->map(function ($group) {
            return $group->count();
        })->toArray();

select * from `login_activities`
---

        // ============================= End dashboard statistics =============================================

        $browser = LoginActivities::all()->groupBy('browser')->map(function ($browser) {
            return $browser->count();
        })->toArray();

select count(*) as aggregate from `users`
---
            return $platform->count();
        })->toArray();

        $country = User::select('country', DB::raw('count(*) as count'))
            ->groupBy('country')
            ->orderByDesc('count')
            ->limit(5)
            ->pluck('count', 'country')
            ->toArray();