app/Http/Controllers/Backend/DashboardController.php

            ->values();

        // Get transaction statistics by type with eager loading
        $schemaStats = Transaction::with(['user', 'staff', 'depositMethod', 'withdrawMethod'])
            ->select([
                'type',
                DB::raw('SUM(CASE WHEN status = "success" THEN amount ELSE 0 END) as total_deposit')
            ])
            ->whereIn('type', [TxnType::Deposit, TxnType::ManualDeposit, TxnType::VoucherDeposit])
            ->groupBy('type')
            ->get()
            ->mapWithKeys(function ($item) {
                $name = match($item->type->value) {
                    TxnType::Deposit->value => 'Direct Deposit',
                    TxnType::ManualDeposit->value => 'Manual Deposit',
                    TxnType::VoucherDeposit->value => 'Voucher Deposit',
                    default => ucfirst(str_replace('_', ' ', $item->type->value))
                };
                return [$name => $item->total_deposit];
            })
            ->toArray();

        // Get transaction statistics with eager loading
        $transactionStats = Transaction::with(['user', 'staff', 'depositMethod', 'withdrawMethod'])
            ->select([
                DB::raw('COUNT(CASE WHEN (type = "withdraw" OR type = "withdraw_auto") AND status = "pending" THEN 1 END) as withdraw_count'),
                DB::raw('COUNT(CASE WHEN type = "manual_deposit" AND status = "pending" THEN 1 END) as deposit_count'),
                DB::raw('SUM(CASE WHEN status = "success" AND type = "send_money" THEN amount ELSE 0 END) as total_send'),
                DB::raw('SUM(CASE WHEN status = "success" AND (type = "manual_deposit" OR type = "deposit" OR type = "voucher_deposit") THEN amount ELSE 0 END) as total_deposit'),
                DB::raw('SUM(CASE WHEN status = "success" AND (type = "withdraw" OR type = "withdraw_auto") THEN amount ELSE 0 END) as total_withdraw'),
                DB::raw('SUM(CASE WHEN status = "success" AND type = "ib_bonus" THEN amount ELSE 0 END) as total_ib_bonus'),
                DB::raw('SUM(CASE WHEN status = "success" AND (type = "interest" OR type = "bonus" OR type = "signup_bonus") THEN amount ELSE 0 END) as total_profit'),
                DB::raw('SUM(CASE WHEN status = "success" AND type = "deposit" THEN amount ELSE 0 END) as total_investment')
            ])->first();

        // Get daily statistics with eager loading
        $dailyStats = Transaction::with(['user', 'staff'])
            ->select(
                DB::raw('DATE(created_at) as date'),
                'type',
                DB::raw('SUM(amount) as total')
            )
            ->where('status', TxnStatus::Success)
            ->whereBetween('created_at', $dateFilter)
            ->groupBy('date', 'type')
            ->get();
---
select * from `transactions` where `status` = 'success' and (`type` = 'withdraw' or `type` = 'withdraw_auto') and `created_at` between '2023-12-28 21:42:08' and '2024-01-13 21:42:08'
select * from `users`
select sum(`amount`) as aggregate from `transactions` where `status` = 'success' and (`type` = 'manual_deposit' or `type` = 'deposit')

        )->first();

        // Get ticket statistics
        $ticketStats = Ticket::selectRaw('
            COUNT(*) as total_tickets,
            COUNT(CASE WHEN status = "open" THEN 1 END) as open_tickets,
            COUNT(CASE WHEN status = "closed" THEN 1 END) as closed_tickets
        ')->first();
---
select count(*) as aggregate from `tickets`